In [1]:
with open('abc/text.txt', 'w') as f:
    f.write('hello')

In [5]:
f = open('abc/text.txt', 'r')
f.read()
f.close()

In [16]:
with open('abc/text.txt', 'w', encoding="utf-8") as f:
    f.write("안녕하세요.")

In [17]:
with open('abc/text.txt', 'r+', encoding="utf-8") as f:
    content = f.read()

In [ ]:
with open('abc/text.txt', 'r' , encoding='utf-8') as f:
    txtfile = f.read()
    print(txtfile)

안녕하세요.

In [23]:
with open('abc/text1.txt', 'a', encoding='utf-8') as f:
    f.write('추가합니다.\n')
    f.write('야호 ~~')

In [24]:
with open('abc/text1.txt', 'r' , encoding='utf-8') as f:
    txtfile = f.read()
    print(txtfile)

추가합니다.
야호<br>~~추가합니다.
야호</br>~~추가합니다.
야호 ~~

In [25]:
lines = ["첫 번째 줄입니다.\n", "두 번째 줄입니다.\n", "세 번째 줄입니다.\n"]
with open('output.txt', 'w') as f:
    f.writelines(lines)

In [30]:
with open("output.txt", "r", encoding="utf-8") as f:
    lines = f.readlines()

print(lines)
print(type(lines))

for line in lines:
    print(line.strip())

['첫 번째 줄입니다.\n', '두 번째 줄입니다.\n', '세 번째 줄입니다.\n']
<class 'list'>
첫 번째 줄입니다.
두 번째 줄입니다.
세 번째 줄입니다.

In [33]:
with open("output.txt", "r", encoding="utf-8") as f:
    line = f.readline()
    print(line)

첫 번째 줄입니다.

# 피클, 직렬화/역직렬화

In [34]:
import pickle

# 직렬화할 데이터
data = {
    'name': '홍길동',
    'age': 30,
    'scores': [90, 85, 88]
}

# 직렬화하여 파일에 저장
with open('abc/data.pickle', 'wb') as f:
    pickle.dump(data, f)

# 파일에서 역직렬화하여 읽기
with open('abc/data.pickle', 'rb') as f:
    loaded_data = pickle.load(f)

print(loaded_data)  # 원본 데이터가 그대로 복원됨

{'name': '홍길동', 'age': 30, 'scores': [90, 85, 88]}

In [35]:
data

{'name': '홍길동', 'age': 30, 'scores': [90, 85, 88]}

In [ ]:
#json 형식

In [36]:
import json

In [38]:
with open('abc/data.json', 'w') as f:
    json.dump(data, f, ensure_ascii=False)

In [39]:
with open('abc/data.json', 'r') as f:
    loaded_txt = json.load(f)
    
print(loaded_txt)

{'name': '홍길동', 'age': 30, 'scores': [90, 85, 88]}

In [40]:
import csv
data = [['name', 'age'], ['bob', 20], ['alice', 15]]
data

[['name', 'age'], ['bob', 20], ['alice', 15]]

In [41]:
# 직렬화하여 파일에 저장
with open('abc/data.csv', 'w') as f:
    wrt = csv.writer(f)
    wrt.writerow(data)

In [42]:
import pandas as pd
df = pd.DataFrame(data)
df.to_csv('abc/data_df.csv')

In [43]:
pd.read_csv('abc/data_df.csv')

   Unnamed: 0      0    1
0           0   name  age
1           1    bob   20
2           2  alice   15

In [50]:
df.rename(columns={0: 'name', 1: 'age'}, inplace=True)
df

    name  age
0   name  age
1    bob   20
2  alice   15

# 판다스 문제 풀어보기

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#import seaborn as sns

np.random.seed(0)

In [2]:
# insurance.csv'파일 읽어서 df에 할당하고, 상위 5개 항목 출력하기
df = pd.read_csv('abc/data/insurance.csv', encoding="utf-8")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [3]:
# df의 요약(평균, 4분위수, 전체 갯수 등)정보 확인하기
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [4]:
#신규 컬럼(double bmi)을 생성하고, bmi의 2배가 되는 값을 할당하기
df["double_bmi"] = df["bmi"] * 2
df.head()

   age     sex     bmi  children smoker     region      charges  double_bmi
0   19  female  27.900         0    yes  southwest  16884.92400       55.80
1   18    male  33.770         1     no  southeast   1725.55230       67.54
2   28    male  33.000         3     no  southeast   4449.46200       66.00
3   33    male  22.705         0     no  northwest  21984.47061       45.41
4   32    male  28.880         0     no  northwest   3866.85520       57.76

In [5]:
# 신규 컬럼(debt)을 생성하고, 0으로 채우기
df['debt'] = 0
df.head()

,age,sex,bmi,children,smoker,region,charges,double_bmi,debt
0,19,female,27.900,0,yes,southwest,16884.92400,55.80,0
1,18,male,33.770,1,no,southeast,1725.55230,67.54,0
2,28,male,33.000,3,no,southeast,4449.46200,66.00,0
3,33,male,22.705,0,no,northwest,21984.47061,45.41,0
4,32,male,28.880,0,no,northwest,3866.85520,57.76,0

In [6]:
# debt에 0부터 값이 증가하도록 채우기
df['debt'] = range(len(df))
df.head()

,age,sex,bmi,children,smoker,region,charges,double_bmi,debt
0,19,female,27.900,0,yes,southwest,16884.92400,55.80,0
1,18,male,33.770,1,no,southeast,1725.55230,67.54,1
2,28,male,33.000,3,no,southeast,4449.46200,66.00,2
3,33,male,22.705,0,no,northwest,21984.47061,45.41,3
4,32,male,28.880,0,no,northwest,3866.85520,57.76,4

In [7]:
# 1번 인덱스의 정보 출력
df.iloc[1]

age                  18
sex                male
bmi               33.77
children              1
smoker               no
region        southeast
charges       1725.5523
double_bmi        67.54
debt                  1
Name: 1, dtype: object

In [8]:
# 'double bmi'열 삭제하기
df = df.drop(["double_bmi"], axis=1)
df.head()

   age     sex     bmi  children smoker     region      charges  debt
0   19  female  27.900         0    yes  southwest  16884.92400     0
1   18    male  33.770         1     no  southeast   1725.55230     1
2   28    male  33.000         3     no  southeast   4449.46200     2
3   33    male  22.705         0     no  northwest  21984.47061     3
4   32    male  28.880         0     no  northwest   3866.85520     4

In [9]:
# 'age'열, 'sex'열만 출력하기
df[["age", "sex"]].head()

   age     sex
0   19  female
1   18    male
2   28    male
3   33    male
4   32    male

In [10]:
# 나이를 1살씩 증가시키기
df["age"] = df["age"]+1
df.head()

   age     sex     bmi  children smoker     region      charges  debt
0   20  female  27.900         0    yes  southwest  16884.92400     0
1   19    male  33.770         1     no  southeast   1725.55230     1
2   29    male  33.000         3     no  southeast   4449.46200     2
3   34    male  22.705         0     no  northwest  21984.47061     3
4   33    male  28.880         0     no  northwest   3866.85520     4

In [11]:
# charges의 표시형식을 소수점 아래 2자리로 바꾸기
# df["charges"].apply(lambda x: round(x, 2))
df["charges"] = df["charges"].astype(float)
df["charges"] = df["charges"].map(lambda x: round(x,2))
df.head()

   age     sex     bmi  children smoker     region   charges  debt
0   20  female  27.900         0    yes  southwest  16884.92     0
1   19    male  33.770         1     no  southeast   1725.55     1
2   29    male  33.000         3     no  southeast   4449.46     2
3   34    male  22.705         0     no  northwest  21984.47     3
4   33    male  28.880         0     no  northwest   3866.86     4

In [12]:
# 컬럼 정렬(알파벳 순서대로) : age, bmi, charges... 순으로 정렬
df = df.sort_index(axis=1)
df.head()

   age     bmi   charges  children  debt     region     sex smoker
0   20  27.900  16884.92         0     0  southwest  female    yes
1   19  33.770   1725.55         1     1  southeast    male     no
2   29  33.000   4449.46         3     2  southeast    male     no
3   34  22.705  21984.47         0     3  northwest    male     no
4   33  28.880   3866.86         0     4  northwest    male     no

In [14]:
# 값 정렬(age) : 나이 순으로 정렬
df = df.sort_values(by="age", ascending=True)
df

      age     bmi   charges  children  debt     region     sex smoker
866    19  37.290   1141.45         0   866  southeast    male     no
50     19  35.625   2211.13         0    50  northeast  female     no
181    19  38.280   1631.82         0   181  southeast  female     no
359    19  20.790   1607.51         0   359  southeast  female     no
369    19  30.400   3481.87         3   369  northeast    male     no
...   ...     ...       ...       ...   ...        ...     ...    ...
94     65  31.300  47291.06         2    94  southwest  female    yes
199    65  39.330  14901.52         0   199  northeast  female     no
1265   65  23.760  26926.51         0  1265  southeast    male    yes
420    65  33.880  46889.26         0   420  southeast    male    yes
418    65  39.160  14418.28         1   418  southeast    male     no

[1338 rows x 8 columns]

In [18]:
# 나이('age') 평균구하기
df_am = df["age"].mean()
df_am

np.float64(40.20702541106129)

In [20]:
# 보험료('charges')와 가장 상관관계가 높은 변수는?
# 공분산: df.cov()
# 상관계수: df.corr()

df_numeric = df.select_dtypes(include='number')
corr = df_numeric.corr()

# 'charges'와 다른 변수들의 상관계수만 보기
charges_corr = corr["charges"].drop("charges")

#가장 상관관계 높은 변수 찾기
most_corr = charges_corr.abs().idxmax()
corr_value = charges_corr[most_corr]

print(f"보험료(charges)와 가장 상관관계가 높은 변수는 '{most_corr}'이고, 상관계수는 {corr_value:.2f}입니다.")

보험료(charges)와 가장 상관관계가 높은 변수는 'age'이고, 상관계수는 0.30입니다.

In [ ]:
# 남자, 여자가 각각 몇명있는지 구하기

In [ ]:
# 자녀(children)가 3명인 데이터 출력하기

In [ ]:
# 자녀(children)가 5명 이상인 데이터 출력하기

In [ ]:
# bmi가 17 미만인 데이터 출력하기

In [ ]:
# 성별에 따른 보험료 평균

In [ ]:
# 흡연여부에 따른 보험료 평균

In [ ]:
# 지역별 보험료 평균

In [ ]:
# 흡연여부 + 지역별 데이터 평균

In [ ]:
# 흡연여부 + 지역별 데이터 평균에서 'charges' 만 츨력하기

In [ ]:
# 흡연여부 + 지역별 데이터 크기(size)

In [ ]:
# smoker 여부에 따라, group_val 컬럼에 '흡연자', '비흡연자' 표시하기